Revit 2027 API
FamilyItemFactory.NewReferencePoint(XYZ) Method
Create a reference point at a given location in an Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferencePoint NewReferencePoint(
	XYZ A_0
)
Public Function NewReferencePoint (
	A_0 As XYZ
) As ReferencePoint
public:
ReferencePoint^ NewReferencePoint(
	XYZ^ A_0
)
member NewReferencePoint :
        A_0 : XYZ -> ReferencePoint
Parameters
A_0 XYZ
Return Value
ReferencePoint
The newly created ReferencePoint.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the argument is null.
InvalidOperationException |  Thrown when the family is not a Conceptual Mass Family.
Remarks
The ReferencePoint will have a default coordinate system corresponding to the global coordinate system.
See Also
Reference
FamilyItemFactory Class
NewReferencePoint Overload
Autodesk.Revit.Creation Namespace